IDEA Open Model
ConcreteBlockData.Id Property
Compatible with IDEA StatiCa Beta 20.0
 Plate unique ID
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public int Id { get; set; }
Public Property Id As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ConcreteBlockData Class
IdeaRS.OpenModel.Connection Namespace